BOT_TOKEN = ''
BOTAN_KEY = ''
email_login = ''
email_password = ''
manager_email = ''

main_text = 'Главное меню'
help_message = '''Профессиональная разработка чат-ботов для Telegram:

Бот: @Kronver_bot
Контакт: @fomchenkov_v'''
work_types = [
    'Аспирантский реферат',
    'Бизнес-план',
    'Дипломная работа',
    'Доклад',
    'Контрольная работа',
    'Курсовая работа',
    'Магистерская диссертация',
    'Нормоконтроль',
    'Ответы на билеты',
    'Отчет по практике',
    'Перевод текстов',
    'Практическая работа',
    'Презентация',
    'Реферат',
    'Решение задач',
    'Чертеж',
    'Эссе, сочинение',
]
main_manu_buttons = [
    'Заказать работу',
    'Наши услуги',
    # 'Узнать стоимость работы', # TODO
    # 'Вопрос-Ответ', # TODO
    # 'Задайть свой вопрос', # TODO
    'Гарантии',
    'Контакты',
    'О компании',
]
services = [
    '''*Дипломная работа*

    Стоимость от 7 500 Р.
    Срок: 14-20 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Курсовая работа*

    Стоимость от 1 400 Р.
    Срок: 5-7 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Контрольная работа*

    Стоимость от 200 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Реферат*

    Стоимость от 500 Р.
    Срок: 3-5 дней

    Бесплатные доработки
    Ведение до защиты
    ''',
    '''*Нормоконтроль*

    Стоимость от 400 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Доклады*

    Стоимость от 300 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Создание презентаций на заказ*

    Стоимость от 400 Р.
    Срок: 2-4 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Решение задач*

    Стоимость от 80 Р.
    Срок: 1-3 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Чертёж на заказ*

    Стоимость от 300 Р.
    Срок: 3-5 дней

    Бесплатные доработки
    Ведение до защиты''',
]
assurances = [
    '''*1. Гарантия выполнения работы*

Компания «Studyfive» занимается написанием студенческих работ с 2008 года. За период работы накоплен огромный опыт в этой сфере. Мы предложим Вам выгодную цену за оригинальную работу высокого качества.''',
    '''*2. Служба контроля качества*

Гарантией того, что Ваша работа не будет скачена автором с интернета, является служба контроля качества. Прежде чем попасть в Ваши руки работа проходит проверку и в случае выявления каких либо недостатков направляется на исправление автору.''',
    '''*3. Поддержка в гарантийный период*

Каждую работу мы сопровождаем до защиты, выполняем бесплатные доработки в пределах первоначального задания. На все работы действует гарантийный срок: дипломные работы-60 дней, другие работы -45 дней. Если срок проверки Вашей работы займет более длительное время, то возможность выполнения корректировок обговаривается индивидуально.''',
    '''*4. Мы заключаем договор оферты*

Заключение договора, гарантирует выполнение работы в соответствии с условиями договора.''',
    '''*5. Квалифицированные специалисты*

Как известно профессионализм-залог успеха. В своей деятельности мы руководствуемся именно этим правилом и доверяем написание работ только профессионалам своего дела.  Написанием работ в нашей компании занимаются грамотные специалисты с большим опытом написания научных работ,  действующие и бывшие сотрудники высших учебных заведений страны.''',
    '''*6. Полная конфиденциальность и безопасность платежей*

Заказывая работу у нас, Вы можете быть уверены в том, что об этом кроме Вас никто не узнает. Studyfive.ru — обеспечивает защиту платежей и личных данных сертификатами SSL''',
]
contacts = '''*Контакты*

8 (800) 350 37 87
zakaz@studyfive.ru'''
about_company_text = '''*О компании*

Создание максимально удобных условий для нашего заказчика. 

Работа официально, именно работая, в соответствии с Российским законодательством позволяет нашим заказчикам быть уверенным в том, что их работа будет выполнена в соответствии с требованиями и права заказчика будут соблюдены.

Работа по схеме «Утром деньги, вечером стулья» зачастую неудобна для заказчиков, в связи с чем, мы предлагаем «Безопасную сделку» нашим клиентам: предоплата 50% в день заказа, оставшиеся 50%, оплачиваются заказчиком после выполнения заказа.

Это оперативный ответ на ваши письма, звонки, сообщения, смс в формате 18 часов в день, 7 дней в неделю.

Отличное качество по доступной цене.

Мы заботимся о своем заказчике и именно поэтому, на нашем сайте Вы всегда можете найти акции, которые направлены на снижение стоимости заказа.
'''
