BOT_TOKEN = ''
BOTAN_KEY = ''
email_login = ''
email_password = ''
manager_email = ''

main_text = 'Главное меню'
help_message = '''Профессиональная разработка чат-ботов для Telegram:

Бот: @Kronver_bot
Контакт: @fomchenkov_v'''
work_types = [
    'Аспирантский реферат',
    'Бизнес-план',
    'Дипломная работа',
    'Доклад',
    'Контрольная работа',
    'Курсовая работа',
    'Магистерская диссертация',
    'Нормоконтроль',
    'Ответы на билеты',
    'Отчет по практике',
    'Перевод текстов',
    'Практическая работа',
    'Презентация',
    'Реферат',
    'Решение задач',
    'Чертеж',
    'Эссе, сочинение',
]
main_manu_buttons = [
    'Заказать работу',
    'Наши услуги',
    'Вопрос-Ответ',
    # 'Узнать стоимость работы', # TODO
    # 'Задать свой вопрос', # TODO
    'Гарантии',
    'Контакты',
    'О компании',
]
services = [
    '''*Дипломная работа*

    Стоимость от 7 500 Р.
    Срок: 14-20 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Курсовая работа*

    Стоимость от 1 400 Р.
    Срок: 5-7 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Контрольная работа*

    Стоимость от 200 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Реферат*

    Стоимость от 500 Р.
    Срок: 3-5 дней

    Бесплатные доработки
    Ведение до защиты
    ''',
    '''*Нормоконтроль*

    Стоимость от 400 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Доклады*

    Стоимость от 300 Р.
    Срок: 1-3 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Создание презентаций на заказ*

    Стоимость от 400 Р.
    Срок: 2-4 дня

    Бесплатные доработки
    Ведение до защиты''',
    '''*Решение задач*

    Стоимость от 80 Р.
    Срок: 1-3 дней

    Бесплатные доработки
    Ведение до защиты''',
    '''*Чертёж на заказ*

    Стоимость от 300 Р.
    Срок: 3-5 дней

    Бесплатные доработки
    Ведение до защиты''',
]
assurances = [
    '''*1. Гарантия выполнения работы*

Компания «Studyfive» занимается написанием студенческих работ с 2008 года. За период работы накоплен огромный опыт в этой сфере. Мы предложим Вам выгодную цену за оригинальную работу высокого качества.''',
    '''*2. Служба контроля качества*

Гарантией того, что Ваша работа не будет скачена автором с интернета, является служба контроля качества. Прежде чем попасть в Ваши руки работа проходит проверку и в случае выявления каких либо недостатков направляется на исправление автору.''',
    '''*3. Поддержка в гарантийный период*

Каждую работу мы сопровождаем до защиты, выполняем бесплатные доработки в пределах первоначального задания. На все работы действует гарантийный срок: дипломные работы-60 дней, другие работы -45 дней. Если срок проверки Вашей работы займет более длительное время, то возможность выполнения корректировок обговаривается индивидуально.''',
    '''*4. Мы заключаем договор оферты*

Заключение договора, гарантирует выполнение работы в соответствии с условиями договора.''',
    '''*5. Квалифицированные специалисты*

Как известно профессионализм-залог успеха. В своей деятельности мы руководствуемся именно этим правилом и доверяем написание работ только профессионалам своего дела.  Написанием работ в нашей компании занимаются грамотные специалисты с большим опытом написания научных работ,  действующие и бывшие сотрудники высших учебных заведений страны.''',
    '''*6. Полная конфиденциальность и безопасность платежей*

Заказывая работу у нас, Вы можете быть уверены в том, что об этом кроме Вас никто не узнает. Studyfive.ru — обеспечивает защиту платежей и личных данных сертификатами SSL''',
]
contacts = '''*Контакты*

8 (800) 350 37 87
zakaz@studyfive.ru'''
about_company_text = '''*О компании*

Создание максимально удобных условий для нашего заказчика. 

Работа официально, именно работая, в соответствии с Российским законодательством позволяет нашим заказчикам быть уверенным в том, что их работа будет выполнена в соответствии с требованиями и права заказчика будут соблюдены.

Работа по схеме «Утром деньги, вечером стулья» зачастую неудобна для заказчиков, в связи с чем, мы предлагаем «Безопасную сделку» нашим клиентам: предоплата 50% в день заказа, оставшиеся 50%, оплачиваются заказчиком после выполнения заказа.

Это оперативный ответ на ваши письма, звонки, сообщения, смс в формате 18 часов в день, 7 дней в неделю.

Отличное качество по доступной цене.

Мы заботимся о своем заказчике и именно поэтому, на нашем сайте Вы всегда можете найти акции, которые направлены на снижение стоимости заказа.
'''
# [question, answer]
questions_answers = [
    ['По каким дисциплинам вы выполняете работы?', 'Компания «StudyFive» выполняет работы практически по всем дисциплинам: гуманитарным, экономическим, юридическим, техническим, естественным, программированию. Для того, чтобы уточнить возможность выполнения Вашего заказа, необходимо оформить заявку (https://studyfive.ru/zakazat-rabotu.html) на нашем сайте, отправить письмо на электронную почту zakaz@studyfive.ru или позвонить менеджеру, по номеру указанному на нашем сайте. *Обращаем Ваше внимание, что оформление заявки не означает принятие заказа в работу. Ваш заказ поступает в работу, только после согласования существенных условий заказа и частичной оплаты.'],
    ['Как узнать стоимость и сроки выполнения работы?', 'Информацию о стоимости и сроках выполнения работ можно найти на нашем сайте, на странице Услуги и цены (https://studyfive.ru/uslugi-i-ceny.html), для более точной информации необходимо заполнить заявку (https://studyfive.ru/vopros-otvet.html) или обратиться к менеджеру. *Мы постоянно проводим различные акции, в связи с чем стоимость некоторых работ может существенно отличаться от той, которая указана на сайте. Для того чтобы узнать стоимость работы с учетом скидки, необходимо пройти по ссылке Узнать стоимость (https://studyfive.ru/).'],
    ['Как заказать работу?', '1. Для Вашего удобства, на нашем сайте предусмотрена возможность электронного заказа работы . Для заказа работы необходимо заполнить форму заказа (https://studyfive.ru/zakazat-rabotu.html) и нажать кнопку «Заказать». *Обращаем Ваше внимание на то, что подробное и точное заполнение формы заказа - это залог успешной сдачи работы. 2. После получения Вашей заявки, менеджер компании свяжется с Вами и озвучит условия выполнения работы. *Наш опыт показывает, что для более продуктивной работы, необходимо общаться с менеджером компании «StudyFive» по электронной почте (zakaz@studyfive.ru). Данный вид связи позволяет максимально точно (без какого либо искажения) донести важную информацию до Автора, что является основой успешного выполнения работы. 3. Если Вы согласны с условиями выполнения работы (со стоимостью и сроками выполнения), Вам необходимо оплатить 50 процентов от суммы заказа любым удобным для Вас способом (https://studyfive.ru/oplata.html) и сообщить об этом Менеджеру. После поступление денежных средств на счет Исполнителя, Автор приступает к написанию Вашей работы.'],
    ['Срок выполнения заказа?', 'Срок выполнения заказа вы можете увидеть в разделе услуги и цены. Иногда данный срок может меняться из-за загруженности автора, для уточнения следует связаться с менеджером или заполнить форму.'],
    ['Как можно получить готовую работу?', 'После того, как Ваша работа готова, мы высылаем на Ваш электронный адрес демо-версию работы, для того чтобы вы могли убедиться в ее готовности, после чего оплачиваете оставшуюся сумму и получаете работу в полном объеме. *Наша компания "идет в ногу со временем" и во всех организационных процессах использует электронный документооборот.'],
    ['Как оплатить заказ?', 'Оплата заказа возможна различными способами, со способами оплаты можно ознакомиться здесь. * Самым удобным и безопасным способом оплаты на наш взгляд, является оплата заказа посредством перевода денежных средств через мобильный банк (банковскую карту). Одним из главных ее плюсов является мгновенный перевод денежных средств, и возможность их возврата при ошибочном переводе.'],
    ['Гарантии выполнения заказа?', 'Наша компания занимается написанием научных работ уже более 5 лет, за это время мы получили сотни благодарственных писем, нашли своего постоянного клиента, который советует нас своим друзьям и знакомым, сплотили вокруг себя сильную команду из авторов и профессиональных менеджеров- это и является самой важной гарантией выполнения Вашей работы. Так же гарантией выполнения работы является, то, что наша компания официально зарегистрирована в соответствии с законодательством Российской Федерации и несет ответственность за невыполнение Вашей работы. Принимая заказ в работу, мы принимаем условия публичной оферты (договора), которые обязуемся исполнять. Оферта указана на сайте. Денежные средства за выполненную работу, перечисляются на счет компании, только после выполнения работы в полном объеме.'],
    ['Что делать если преподаватель отправил работу на доработку?', 'У каждого преподавателя свой взгляд на одну и ту же тему. Внесение изменений преподавателем в уже готовую работу - это обязательная составляющая учебного процесса и именно поэтому мы не заканчиваем работу с Вами после того, как отправили ее Вам. В случае если преподаватель внес какие-либо изменения, не стоит переживать. В данном случае необходимо подробно описать «замечания» преподавателя и отправить их нам, после чего Автор нашей компании внесет корректировки в работу и отправит ее Вам, уже в измененном виде. Исходя из своего опыта, советуем всем студентам перед началом написания работы, согласовать с преподавателем структуру работы и основные моменты, которые будут отражены в ней. Данное действие позволит минимизировать внесение изменений в уже готовую работу, а следовательно сократить время на ее подготовку. *Процесс написания дипломной (магистерской, курсовой) работы занимает длительное время и именно поэтому советуем всем студентам заблаговременно приступить к созданию научного труда.'],
    ['Что поможет защитить работу на «отлично»?', 'Готовая научная работа, выполненная в соответствии с учебно- методическими требованиями и раскрывающая тему работы в полном объеме-это лишь малая составляющая "отличной" защиты. Не менее важным является возможность спикера (докладчика) раскрыть и донести до комиссии ту информацию, которая отражена в работе, ответить на поставленные вопросы и высказать собственное мнение по теме доклада. Так же большое влияние на оценку комиссии, при защите диплома оказывает взаимоотношения докладчика с его научным руководителем, т.к оценка отраженная в отзыве научного руководителя оказывает большое "воздействие" на членов комиссии при принятии окончательного решения. * Компания «StudyFive» желает всем студентам защититься на отлично и напоминает, что лучшей гарантией отличной защиты является знание темы, последовательная подготовка научной работы и наличие времени до защиты.'],
    ['Не могу дозвониться до менеджера, что делать?', 'Отсутствие ответа менеджера на звонок- означает его высокую загруженность. Уважаемый клиент! Обращаем Ваше внимание на следующие моменты: • Компания «StudyFive» работает со студентами со всех уголков России и стран СНГ (11 часовых поясов) и зачастую, когда у Вас утро, у менеджера компании еще ночь, и его нет на рабочем месте, в связи с чем звонок остается без ответа. • Так же хотим обратить Ваше внимание на сезонность нашей работы (большое количество звонков во время сессии), и именно в это время менеджеры нашей компании очень загружены. • В нашей компании действует правило «Персонального менеджера». Данное правило означает, что от заказа работы и до ее выполнения Вас сопровождает один менеджер, а следовательно и отвечать на Ваши звонки будет только тот менеджер, который принял заказ, никакой другой менеджер не может вмешиваться в работу своего коллеги. Именно по вышеизложенным причинам менеджеры компании не всегда успевают обработать все звонки которые поступают в нашу компанию, в связи с чем настоятельно просим Вас осуществлять связь с менеджером по электронной почте (почему лучше общаться с менеджером по почте, см. вопрос "Как заказать работу" п.2 * Мы обещаем меняться в лучшую сторону благодаря Вашим замечаниям и предложениям, которые вы можете направить на почту admin@studyfive.ru.'],
    ['Насколько уникальна будет работа?', 'Уникальность Вашей работы зависит от предмета, по которому выполняется работа и от популярности темы. Уникальность работы по техническим и экономическим дисциплинам достигает 99%, в то время как по гуманитарным едва переваливается за 80%. Мы с Вами живем в веке технологий и массовых коммуникаций. В настоящее время в сети Интернет в открытом доступе находится большое количество научной литературы, в том числе учебно-методических пособий, научных диссертаций, монографий и иных научных и исследовательских работ. При написании работы, авторами компании используется большое количество научной литературы, в том числе и той, которая размещена в интернете, именно та часть работ, которая заимствована авторами и размещена в интернете, в виде учебных пособий определяется программой "Антиплагиат" как заимствование, что снижает % оригинальности работы. В то же время, подготовка научной работы не возможна без цитирования других авторов, так как при полном отсутствии заимствований или ссылок на иные научные труды теряется сама научность работы. * Наш опыт работы показывает, что при проверке на уникальность одной и той же научной работы, различными программами "Антиплагиат", программы показывают разный результат, порой доходит до того, что одна программа показывает 50% оригинальности, а другая 100%, в связи с чем, просим Вас при заказе работы, сообщить менеджеру наименование программы, с помощью которой будет проверяться уникальность Вашей работы. Все работы написанные Авторами нашей компании проходят проверку на сайте www.antiplagiat.ru'],
]
